import React from "react";

const Page = () => {
  return (
    <main className="container py-24 min-h-full">
      <h2 className="scroll-m-20 border-b pb-2 text-3xl font-semibold tracking-tight first:mt-0 mb-3">
        Политика конфиденциальности
      </h2>
      <p className="text-lg mb-4">
        Этот документ описывает, как мы собираем, используем и защищаем вашу
        личную информацию при использовании нашего веб-сайта, приложения или
        услуг.
      </p>

      <h3 className="scroll-m-20 text-2xl font-semibold tracking-tight">
        Сбор информации
      </h3>
      <p className="text-lg mb-4">
        Мы собираем личную информацию, которую вы предоставляете нам при
        регистрации на нашем сайте, оформлении заказов, подписке на рассылку или
        взаимодействии с нашими услугами. Эта информация может включать ваше
        имя, адрес электронной почты, номер телефона и другие данные,
        необходимые для предоставления вам услуг.
      </p>

      <h3 className="scroll-m-20 text-2xl font-semibold tracking-tight">
        Использование информации
      </h3>
      <p className="text-lg mb-4">
        Мы используем предоставленную вами информацию для обеспечения
        качественного обслуживания, оформления заказов, улучшения наших услуг и
        отправки вам информации о наших продуктах и акциях. Мы также можем
        использовать вашу информацию для анализа пользования нашими услугами,
        улучшения пользовательского опыта и обеспечения безопасности.
      </p>

      <h3 className="scroll-m-20 text-2xl font-semibold tracking-tight">
        Защита информации
      </h3>
      <p className="text-lg mb-4">
        Мы принимаем меры для защиты вашей личной информации от
        несанкционированного доступа, использования или разглашения. Мы храним
        предоставленные вами данные на защищенных серверах и используем
        шифрование для передачи чувствительной информации.
      </p>

      <h3 className="scroll-m-20 text-2xl font-semibold tracking-tight">
        Раскрытие информации третьим лицам
      </h3>

      <p className="text-lg mb-4">
        Мы не передаем вашу личную информацию третьим лицам без вашего согласия,
        за исключением случаев, когда это требуется законом или судебным
        решением.
      </p>

      <h3 className="scroll-m-20 text-2xl font-semibold tracking-tight">
        Обновления политики конфиденциальности
      </h3>
      <p className="text-lg mb-4">
        Мы оставляем за собой право обновлять эту политику конфиденциальности по
        мере необходимости. Мы рекомендуем вам время от времени проверять эту
        страницу для ознакомления с любыми изменениями.
      </p>

      <h3 className="scroll-m-20 text-2xl font-semibold tracking-tight">
        Принятие условий
      </h3>

      <p className="text-lg mb-4">
        Используя наш веб-сайт, приложение или услуги, вы соглашаетесь с этой
        политикой конфиденциальности. Если вы не согласны с этими условиями,
        пожалуйста, не используйте наши услуги.
      </p>
    </main>
  );
};

export default Page;
